Repository: bartersmartplace/polygonwalletbot
Catalog: *_bot/localization/locales/rus/LC_MESSAGES/messages.po
Languages: ru_ru

source: Enter a new password for your new address in the {network_name} blockchain. The password must be at least 8 characters long, contain a special character and a capital letter. This password will be requested to sign transactions and send funds from the wallet. Don't tell anyone about it and keep it a secret. Our service does not store users' passwords, and if you lose it, you will lose access to your wallet and all funds. Save your password on paper as well. Be safe every day.
ru_ru: Введите новый пароль для нового адреса в блокчейне {network_name}. Пароль должен быть длиной не менее 8 символов, содержать специальный символ и заглавную букву. Этот пароль потребуется для подписания транзакций и отправки средств с кошелька. Никому не сообщайте его и храните в секрете. Наш сервис не хранит пароли пользователей, и в случае утраты пароля вы потеряете доступ к своему кошельку и всем средствам. Запишите пароль на бумаге. Будьте внимательны и берегите свои данные.

source: Address: `{address}` successfully created. Please keep your password a secret and store it securely. You can send and receive tokens using this address.
ru_ru: Адрес: `{address}` успешно создан. Пожалуйста, храните пароль в секрете и в надежном месте. Вы можете отправлять и получать токены с помощью этого адреса.

source: Generating an additional address costs {price} {symbol}.
ru_ru: Создание дополнительного адреса стоит {price} {symbol}.

source: Enter the password for the wallet from which the funds will be debited.
ru_ru: Введите пароль от кошелька, с которого будут списаны средства.

source: You paid {amount} {symbol} for a new address. {transaction_hash}
ru_ru: Вы оплатили {amount} {symbol} за новый адрес. {transaction_hash}

source: Transaction hash
ru_ru: Хэш транзакции

source: You sent {amount} {symbol} to {recipient}. {transaction_hash}
ru_ru: Вы отправили {amount} {symbol} на адрес {recipient}. {transaction_hash}

source: Which asset will be sent?
ru_ru: Какой актив будет отправлен?

source: Enter the recipient's {network_name} chain wallet address or @username of the user in Telegram.
ru_ru: Введите адрес кошелька {network_name} или @username пользователя в Telegram.

source: Balance: {balance} {symbol} Enter the amount to send.
ru_ru: Баланс: {balance} {symbol} Введите сумму для отправки.

source: Submit transaction: Value: {amount} {symbol} Recipient: {recipient}
ru_ru: Подтвердите транзакцию: Сумма: {amount} {symbol} Получатель: {recipient}

source: Enter the password for this wallet to confirm the operation.
ru_ru: Введите пароль от этого кошелька для подтверждения операции.

source: The active address is not set, set it with the /addresses command.
ru_ru: Активный адрес не установлен, установите его с помощью команды /addresses

source: Choose option:
ru_ru: Выберите опцию:

source: Total user count: {user_count}
ru_ru: Общее количество пользователей: {user_count}

source: Send the text for the mailing list in English
ru_ru: Отправьте текст для рассылки на английском языке

source: Send the text for the mailing list in Russian
ru_ru: Отправьте текст для рассылки на русском языке

source: Send the URL buttons for the English message in the following format: buttons 1 - http://example1.com buttons 2 - http://example2.com
ru_ru: Отправьте URL-кнопки для английского сообщения в следующем формате: buttons 1 - http://example1.com buttons 2 - http://example2.com

source: Send the URL buttons for the Russian message in the following format: buttons 1 - http://example1.com buttons 2 - http://example2.com
ru_ru: Отправьте URL-кнопки для русского сообщения в следующем формате: кнопка 1 - http://example1.com кнопка 2 - http://example2.com

source: Examples of the messages presented above.
ru_ru: Примеры сообщений представлены выше.

source: The message broadcasting is completed Messages have been sent to {successful_message_count} users
ru_ru: Рассылка завершена Сообщения отправлены {successful_message_count} пользователям

source: There are not enough funds to complete this transaction.
ru_ru: Недостаточно средств для выполнения этой транзакции.

source: The password you provided is invalid. Please check the format and try again.
ru_ru: Указанный вами пароль недействителен. Проверьте формат и попробуйте снова.

source: The address you are trying to create already exists.
ru_ru: Адрес, который вы пытаетесь создать, уже существует.

source: The address you are trying to use does not exist.
ru_ru: Адрес, который вы пытаетесь использовать, не существует.

source: You do not have enough funds for staking. Please ensure your balance meets the minimum requirement.
ru_ru: У вас недостаточно средств для стейкинга. Пожалуйста, убедитесь, что ваш баланс соответствует минимальному требованию.

source: The requested address could not be found.
ru_ru: Запрашиваемый адрес не найден.

source: The value entered is not a valid number. Please provide a numeric value.
ru_ru: Введенное значение не является числом. Пожалуйста, введите числовое значение.

source: The value you entered is too small. Please provide a larger value.
ru_ru: Введенное вами значение слишком мало. Пожалуйста, укажите большее значение.

source: This token is not supported. Please check the token and try again.
ru_ru: Этот токен не поддерживается. Проверьте токен и попробуйте снова.

source: The specified token could not be found. Please verify the token symbol and try again.
ru_ru: Указанный токен не найден. Проверьте символ токена и попробуйте снова.

source: The address is missing a required prefix. Please check the address and try again.
ru_ru: В адресе отсутствует необходимый префикс. Проверьте адрес и попробуйте снова.

source: The address contains invalid characters. Please check and correct the address format.
ru_ru: Адрес содержит недопустимые символы. Проверьте и исправьте формат адреса.

source: The address has an invalid checksum. Please verify the address and try again.
ru_ru: Адрес имеет недействительную контрольную сумму. Проверьте адрес и попробуйте снова.

source: The address you are trying to use is not active. Please check and try again.
ru_ru: Адрес, который вы пытаетесь использовать, не активен. Проверьте и попробуйте снова.

source: Unable to connect to the blockchain node. Please try again later.
ru_ru: Не удалось подключиться к узлу блокчейна. Пожалуйста, попробуйте позже.

source: You don't have enough gas for this operation.
ru_ru: У вас недостаточно газа для выполнения этой операции.

source: The requested block could not be found
ru_ru: Запрашиваемый блок не найден.

source: The transfer amount exceeds your available balance. Please check your balance and try again.
ru_ru: Сумма перевода превышает доступный баланс. Проверьте свой баланс и попробуйте снова.

source: The transaction contains invalid fields. Please check the transaction details and try again.
ru_ru: Транзакция содержит недопустимые поля. Проверьте детали транзакции и попробуйте снова.

source: The transaction is still pending. Please wait for confirmation before proceeding.
ru_ru: Транзакция все еще находится в ожидании. Пожалуйста, дождитесь подтверждения перед продолжением.

source: The transaction failed due to an internal error. Please try again later.
ru_ru: Транзакция не выполнена из-за внутренней ошибки. Пожалуйста, попробуйте позже.

source: A required fee has not been set for the transaction. Please provide the necessary fee and try again.
ru_ru: Для транзакции не установлена необходимая комиссия. Укажите необходимую комиссию и попробуйте снова.

source: The exchange pair you selected is not supported. Please choose a different exchange.
ru_ru: Выбранная вами пара для обмена не поддерживается. Пожалуйста, выберите другой обмен.

source: There is not enough liquidity in the pool
ru_ru: В пуле недостаточно ликвидности

source: The contract does not comply with the ERC20 standard
ru_ru: Контракт не соответствует стандарту ERC20

source: The token has already been added
ru_ru: Токен уже был добавлен

source: <b>Bot commands:</b> /assets - cryptocurrencies in wallet /stake - earn BRTR from staking /addresses - switch wallet /swap - token Exchange using Uniswap /settings - bot settings /referral - get your referral link <b>You can also use text commands:</b> 💸 <b>Transfer tokens:</b> send [value] [token symbol] [User name or wallet address] [wallet password] Example 1: send 10 BRTR @polygonwalletbot Password Example 2: send 10 BRTR 0x17d3d1DA06688bC61592913921414bff09Bc570c Password 💰 <b>Add BRTR to staking:</b> stake 100 Password 🤑 Remove BRTR from staking: burn 100 Password
ru_ru: <b>Команды бота:</b> /assets - криптовалюты в кошельке /stake - заработайте BRTR через стейкинг /addresses - переключить кошелек /swap - обмен токенов через Uniswap /settings - настройки бота /referral - Получить реферальную ссылку <b>Вы также можете использовать текстовые команды:</b> 💸 <b>Перевод токенов:</b> send [сумма] [символ токена] [Имя пользователя или адрес кошелька] [пароль кошелька] Пример 1: send 10 BRTR @polygonwalletbot Пароль Пример 2: send 10 BRTR 0x17d3d1DA06688bC61592913921414bff09Bc570c Пароль 💰 <b>Добавить BRTR в стейкинг:</b> stake 100 Пароль 🤑 Удалить BRTR из стейкинга: burn 100 Пароль

source: ⏳ Wait please...
ru_ru: ⏳ Пожалуйста, подождите...

source: Barter RUB [{link}] is a token linked to the value of the ruble. Get RUB in the ratio of 1:1 to the ruble to buy tokenized assets, goods and services around the world, NFT, and other tokens. Getting a BRUB is simple: 1. Click the Get BRUB button and select the bank to transfer via SBP, 2. Enter the amount for tokenization in the bank's application and confirm the transfer, 3. Send the transfer receipt and the wallet address for crediting tokens to @dprolix.
ru_ru: Barter RUB [{link}] — это токен, привязанный к стоимости рубля. Получайте RUB в соотношении 1:1 к рублю для покупки токенизированных активов, товаров и услуг по всему миру, NFT и других токенов. Получить BRUB просто: 1. Нажмите кнопку «Получить BRUB» и выберите банк для перевода через СБП, 2. Введите сумму для токенизации в приложении банка и подтвердите перевод, 3. Отправьте чек о переводе и адрес кошелька для зачисления токенов @dprolix.

source: You can return from 100000 BRUB with a 7% commission. Send the wallet address with BRUB and the amount to @dprolix.
ru_ru: Вы можете вернуть от 100000 BRUB с комиссией 7%. Отправьте адрес кошелька с BRUB и сумму на @dprolix.

source: To make a quick token swap, enter a command like "swap [token amount for sale] [token ticker for sale] [token ticker for buy]": swap 10 USDT BRTR Liquidity provided by Uniswap
ru_ru: Чтобы быстро обменять токены, введите команду вида "swap [сумма токенов для продажи] [тикер токена для продажи] [тикер токена для покупки]": swap 10 USDT BRTR Ликвидность предоставлена Uniswap

source: Sell: {amount_to_sell} {sell_symbol} Buy: {amount_to_buy} {buy_symbol} Slippage: 1%
ru_ru: Продажа: {amount_to_sell} {sell_symbol} Покупка: {amount_to_buy} {buy_symbol} Проскальзывание: 1%

source: Enter the password from the currently active wallet to perform the exchange operation
ru_ru: Введите пароль от текущего активного кошелька для выполнения операции обмена

source: The exchange operation has been cancelled
ru_ru: Операция обмена была отменена

source: Staked BRTR: {st_brtr_balance} BRTR balance: {brtr_balance} Stakers: {stakers_count} TVL: {tvl:,} Add to stake from 100 BRTR.
ru_ru: Застейкано BRTR: {st_brtr_balance} Баланс BRTR: {brtr_balance} Ставки: {stakers_count} TVL: {tvl:,} Добавить в стейкинг от 100 BRTR.

source: You paid {price} {symbol} to add token {hash_link}
ru_ru: Вы оплатили {price} {symbol} за добавление нового токена {hash_link}

source: +{amount} BRTR added to staking {hash_link}
ru_ru: +{amount} BRTR добавлено в стейкинг {hash_link}

source: -{amount} BRTR removed from staking. {hash_link}
ru_ru: -{amount} BRTR удалено из стейкинга. {hash_link}

source: How much BRTR to add?
ru_ru: Сколько BRTR добавить?

source: How much BRTR to remove?
ru_ru: Сколько BRTR удалить?

source: Enter token’s smart contract address to add to the wallet
ru_ru: Введите адрес смарт-контракта токена для добавления в кошелек

source: Enter the password from this address to confirm the operation
ru_ru: Введите пароль от этого адреса для подтверждения операции со оплатой

source: Do you want to add {symbol} ?
ru_ru: Хотите добавить {symbol} ?

source: The token {new_token_symbol} will be added for free just for you and recipients. If you want to list a token to the /assets section for everyone users, it costs {price_to_add_erc20_to_everyone} {pay_token_symbol}.
ru_ru: Токен {new_token_symbol} будет добавлен бесплатно только для вас и получателей. Если вы хотите разместить токен в разделе /assets для всех пользователей, это будет стоить {price_to_add_erc20_to_everyone} {pay_token_symbol}.

source: The token {new_token_symbol} will be added for {price_to_add_erc20_to_user} {pay_token_symbol} just for you and recipients. If you want to list a token to the /assets section for everyone users, it costs {price_to_add_erc20_to_everyone} {pay_token_symbol}.
ru_ru: Токен {new_token_symbol} будет добавлен за {price_to_add_erc20_to_user} {pay_token_symbol} только для вас и получателей. Если вы хотите разместить токен в разделе /assets для всех пользователей, это будет стоить {price_to_add_erc20_to_everyone} {pay_token_symbol}.

source: You added new token
ru_ru: Вы добавили новый токен

source: Copy and paste the address you want to select and use:
ru_ru: Скопируйте и вставьте адрес, который вы хотите выбрать и использовать:

source: You don't have any addresses.
ru_ru: У вас нет адресов.

source: Wallet has been changed.
ru_ru: Кошелек был изменен.

source: To top up your balance, transfer money to this address: `{address}`
ru_ru: Для пополнения баланса переведите деньги на этот адрес: `{address}`

source: Invited - {invited} Earned - {earned} {symbol} Referral link, copy and share: `{link}`
ru_ru: Приглашено - {invited} Заработано - {earned} {symbol} Реферальная ссылка, скопируй и поделись: `{link}`

source: Choose language.
ru_ru: Выберите язык.

source: The language has been changed to {language}.
ru_ru: Язык изменен на {language}.

source: Deposit
ru_ru: Пополнить

source: Send
ru_ru: Отправить

source: Confirm
ru_ru: Подтвердить

source: Cancel
ru_ru: Отменить

source: Back
ru_ru: Назад

source: Add
ru_ru: Добавить

source: Remove
ru_ru: Удалить

source: Pay
ru_ru: Заплатить

source: ENGLISH
ru_ru: АНГЛИЙСКИЙ

source: RUSSIAN
ru_ru: РУССКИЙ

source: Get a BRUB
ru_ru: Получить BRUB

source: Return BRUB
ru_ru: Вернуть BRUB

source: Generate New Address
ru_ru: Создать новый адрес

source: Number of users
ru_ru: Количество пользователей

source: Message broadcasting
ru_ru: Трансляция сообщений

source: Add button
ru_ru: Добавить кнопку

source: Send message
ru_ru: Разослать сообщение

source: Add token
ru_ru: Добавить токен

source: Only for me
ru_ru: Только для меня

source: Pay for listing
ru_ru: Оплатить размещение

source: Unknown button
ru_ru: Неизвестная кнопка
